docs/pages/transitions/transitions.md
```mermaid
---
title: Guarded transition diagram
---
stateDiagram-v2
State1 
[*] --> State1
State1 --> State2 : Guarded transition (if State1.value > 10)
State2 --> [*]
```
